tutorials/fluids/poiseuilleChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Channel of height h = 1 m between two walls, periodic in the flow direction
convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 40 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type            cyclic;
        neighbourPatch  outlet;
        faces           ((0 4 7 3));
    }
    outlet
    {
        type            cyclic;
        neighbourPatch  inlet;
        faces           ((1 2 6 5));
    }
    walls
    {
        type            wall;
        faces           ((0 1 5 4) (3 7 6 2));
    }
    frontAndBack
    {
        type            empty;
        faces           ((0 3 2 1) (4 5 6 7));
    }
);

// ************************************************************************* //
